Repository: JosephRoyalEagle/NeuroBlock
Catalog: languages/neuroblock-*.po
Languages: fr_fr

source: AI-powered generator to create custom Gutenberg blocks and WordPress pages with your own API
fr_fr: Générateur IA pour créer des blocs Gutenberg et pages WordPress personnalisés avec votre propre API

source: AI Settings
fr_fr: Paramètres IA

source: Blocks & Pages
fr_fr: Blocs & Pages

source: Generator
fr_fr: Générateur

source: Secured
fr_fr: Sécurisé

source: Configure your AI API
fr_fr: Configurez votre API IA

source: Connect your own API to use NeuroBlock for free. Your keys are encrypted and stored securely.
fr_fr: Connectez votre propre API pour utiliser NeuroBlock gratuitement. Vos clés sont chiffrées et stockées de manière sécurisée.

source: AI Provider
fr_fr: Fournisseur IA

source: API Key
fr_fr: Clé API

source: Your API key is encrypted and never shared
fr_fr: Votre clé API est chiffrée et jamais partagée

source: Model
fr_fr: Modèle

source: Save Settings
fr_fr: Enregistrer les paramètres

source: Gutenberg Block
fr_fr: Bloc Gutenberg

source: Create a new custom block with AI
fr_fr: Créer un nouveau bloc personnalisé avec IA

source: Complete Page
fr_fr: Page complète

source: Generate a complete WordPress page
fr_fr: Générer une page WordPress complète

source: Recent Blocks
fr_fr: Blocs récents

source: Describe what you want to create
fr_fr: Décrivez ce que vous voulez créer

source: Content Type
fr_fr: Type de contenu

source: Elementor Widget
fr_fr: Widget Elementor

source: Complete Elementor Page
fr_fr: Page complète Elementor

source: Complete Gutenberg Page
fr_fr: Page complète Gutenberg

source: Modern
fr_fr: Moderne

source: Minimalist
fr_fr: Minimaliste

source: Professional
fr_fr: Professionnel

source: Creative
fr_fr: Créatif

source: Elegant
fr_fr: Élégant

source: Classic
fr_fr: Classique

source: Generate with AI
fr_fr: Générer avec IA

source: Content generated successfully!
fr_fr: Contenu généré avec succès !

source: Generated Code
fr_fr: Code généré

source: Copy Code
fr_fr: Copier le code

source: Support NeuroBlock
fr_fr: Soutenez NeuroBlock

source: NeuroBlock is free and open source. Your support helps us continue development.
fr_fr: NeuroBlock est gratuit et open source. Votre soutien nous aide à continuer le développement.

source: Recommended
fr_fr: Recommandé

source: Thank you for your support! 🙏
fr_fr: Merci pour votre soutien ! 🙏

source: Generating...
fr_fr: Génération en cours...

source: Please wait while AI generates your content...
fr_fr: Veuillez patienter pendant que l'IA génère votre contenu...

source: Success!
fr_fr: Succès !

source: Error
fr_fr: Erreur

source: Warning
fr_fr: Attention

source: Settings saved successfully
fr_fr: Paramètres enregistrés avec succès

source: Saving...
fr_fr: Enregistrement...

source: Copied!
fr_fr: Copié !

source: Address copied to clipboard
fr_fr: Adresse copiée dans le presse-papier

source: Please enter a description
fr_fr: Veuillez entrer une description

source: Gutenberg is required but not installed. Please install the Gutenberg plugin.
fr_fr: Gutenberg est requis mais n'est pas installé. Veuillez installer le plugin Gutenberg.

source: Elementor is required but not installed. Please install the Elementor plugin.
fr_fr: Elementor est requis mais n'est pas installé. Veuillez installer le plugin Elementor.

source: Block generated successfully! Click the copy button below to copy the code.
fr_fr: Bloc généré avec succès ! Cliquez sur le bouton copier ci-dessous pour copier le code.

source: Page created successfully!
fr_fr: Page créée avec succès !

source: View Page
fr_fr: Voir la page

source: Permission denied
fr_fr: Permission refusée

source: API key not configured
fr_fr: Clé API non configurée

source: Invalid API provider
fr_fr: Fournisseur API invalide

source: Unsupported provider
fr_fr: Fournisseur non supporté

source: API error
fr_fr: Erreur API

source: Prompt is required
fr_fr: La description est requise

source: Generated by NeuroBlock
fr_fr: Généré par NeuroBlock

source: NeuroBlock AI Content
fr_fr: Contenu IA NeuroBlock

source: AI-generated block
fr_fr: Bloc généré par IA

source: NeuroBlock Settings
fr_fr: Paramètres NeuroBlock

source: Generate AI content from NeuroBlock panel
fr_fr: Générer du contenu IA depuis le panneau NeuroBlock

source: Open NeuroBlock
fr_fr: Ouvrir NeuroBlock

source: AI-generated content...
fr_fr: Contenu généré par IA...

source: NeuroBlock AI Block
fr_fr: Bloc IA NeuroBlock

source: Generate content with artificial intelligence
fr_fr: Générer du contenu avec l'intelligence artificielle

source: Use NeuroBlock to generate AI content
fr_fr: Utilisez NeuroBlock pour générer du contenu IA

source: Ex: Create a modern hero section with a catchy title, subtitle and CTA button...
fr_fr: Ex : Créer une section hero moderne avec un titre accrocheur, un sous-titre et un bouton CTA...

source: ago
fr_fr: il y a

source: AI Generator for WordPress - Version
fr_fr: Générateur IA pour WordPress - Version

source: 1. Go to Posts/Pages → Add New<br>2. Click the "+" button<br>3. Search for "HTML"<br>4. Paste the code in the Custom HTML block
fr_fr: 1. Allez dans Articles/Pages → Ajouter<br>2. Cliquez sur le bouton "+"<br>3. Recherchez "HTML"<br>4. Collez le code dans le bloc HTML personnalisé

source: 1. Go to Pages → Add New<br>2. Click "Edit with Elementor"<br>3. Add an HTML widget<br>4. Paste the code in the widget
fr_fr: 1. Allez dans Pages → Ajouter<br>2. Cliquez sur "Éditer avec Elementor"<br>3. Ajoutez un widget HTML<br>4. Collez le code dans le widget
